---
title: WorksharingFailures
classe: Autodesk.Revit.DB.BuiltInFailures+WorksharingFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# WorksharingFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId DuplicateNamesChanged { get; }` | `WorksharingFailures.DuplicateNamesChanged` | FailureDefinitionId |
| `FailureDefinitionId MissingUpdaterLatestOrCentralPlural { get; }` | `WorksharingFailures.MissingUpdaterLatestOrCentralPlural` | FailureDefinitionId |
| `FailureDefinitionId MissingUpdaterLatestOrCentralSingular { get; }` | `WorksharingFailures.MissingUpdaterLatestOrCentralSingular` | FailureDefinitionId |
| `FailureDefinitionId SeriousElementReferenceCorruption { get; }` | `WorksharingFailures.SeriousElementReferenceCorruption` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```